app/Helpers/log_helper.php

INSERT INTO `logs` (`user_id`, `aksi`, `keterangan`, `ip_address`, `created_at`) VALUES ('2', 'AKSES DASHBOARD', 'User membuka halaman Dashboard utama', '::1', '2026-04-24 19:09:23')
---
function panggil_log($aksi, $keterangan)
{
    $logModel = new \App\Models\LogModel();

    // Ambil user_id dari session (sesuaikan dengan key session login kamu)
    $userId = session()->get('id_user') ?: session()->get('id');

    $logModel->save([
        'user_id'    => $userId,
        'aksi'       => $aksi,
        'keterangan' => $keterangan,
        'ip_address' => service('request')->getIPAddress(),
        'created_at' => date('Y-m-d H:i:s')
    ]);