app/Controllers/Alat.php

SELECT *
FROM `alat`
---
    public function index()
    {
        $model = new AlatModel();
        $data = [
            'title' => 'Daftar Alat - Maldin17App',
            'alat'  => $model->findAll()

SELECT *
FROM `alat`
WHERE `alat`.`id` = '11'
---
    public function edit($id)
    {
        $model = new AlatModel();
        $data = [
            'title' => 'Edit Alat - Maldin17App',
            'alat'  => $model->find($id)
        ];