app/Controllers/Denda.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('denda');
        $builder->select('denda.*, peminjaman.nama_peminjam, alat.nama_alat');

        // Pastikan ini JOIN ke tabel peminjaman dan alat agar nama muncul
        $builder->join('peminjaman', 'peminjaman.id = denda.id_peminjaman');
        $builder->join('alat', 'alat.id = peminjaman.id_alat');

        $builder->orderBy('denda.tanggal_dibuat', 'DESC');
        $query = $builder->get();
---
SELECT `denda`.*, `peminjaman`.`nama_peminjam`, `alat`.`nama_alat`
FROM `denda`
JOIN `peminjaman` ON `peminjaman`.`id` = `denda`.`id_peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
ORDER BY `denda`.`tanggal_dibuat` DESC

    public function lunas($id)
    {
        $db = \Config\Database::connect();

        // Update status di tabel denda
        $db->table('denda')->where('id', $id)->update([
            'status_pembayaran' => 'Lunas'
        ]);
---
UPDATE `denda` SET `status_pembayaran` = 'Lunas'
WHERE `id` = '1'