app/Controllers/log.php

    public function index()
    {
        $model = new LogModel();

        // Mengambil data log dan join ke tabel users untuk ambil nama penggunanya
        $data['logs'] = $model->select('logs.*, users.nama as nama_user')
            ->join('users', 'users.id = logs.user_id', 'left')
            ->orderBy('logs.created_at', 'DESC')
            ->findAll();
---
SELECT `logs`.*, `users`.`nama` as `nama_user`
FROM `logs`
LEFT JOIN `users` ON `users`.`id` = `logs`.`user_id`
ORDER BY `logs`.`created_at` DESC