app/Controllers/Peminjaman.php

    public function index()
    {
        $data = [
            'title' => 'Pilih Alat untuk Dipinjam',
            'alat'  => $this->alatModel->where('stok >', 0)->findAll()
        ];
---
SELECT *
FROM `alat`
WHERE `stok` > 0

    public function permintaan()
    {
        $data = [
            'title'      => 'Daftar Permintaan Pinjam',
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->where('peminjaman.status', 'pending')
                ->findAll()
        ];
---
SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` IN ('pending','dipinjam')
ORDER BY `peminjaman`.`status` ASC
SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'pending'

    public function konfirmasi($id)
    {
        $this->db->transStart();
        $dataPinjam = $this->peminjamanModel->find($id);

        if (!$dataPinjam || strtolower($dataPinjam['status']) !== 'pending') {
            return redirect()->back()->with('error', 'Data tidak valid.');
        }

        $alat = $this->alatModel->find($dataPinjam['id_alat']);

        if ($alat['stok'] >= $dataPinjam['jumlah']) {
            $this->peminjamanModel->update($id, [
                'status'     => 'dipinjam',
                'tgl_pinjam' => date('Y-m-d H:i:s')
            ]);

            $this->alatModel->update($dataPinjam['id_alat'], ['stok' => $alat['stok'] - $dataPinjam['jumlah']]);
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '38'
SELECT *
FROM `alat`
WHERE `alat`.`id` = '1'
UPDATE `peminjaman` SET `status` = 'dipinjam', `tgl_pinjam` = '2026-04-24 19:09:38'
WHERE `peminjaman`.`id` IN ('38')
UPDATE `alat` SET `stok` = 0
WHERE `alat`.`id` IN ('1')

    public function pengembalian()
    {
        $data = [
            'title'      => 'Pengembalian Alat',
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->where('peminjaman.status', 'dipinjam')
                ->findAll()
        ];
---
SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'pending'
SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'dipinjam'

    public function proses_kembali($id)
    {
        $peminjaman = $this->peminjamanModel->find($id);

        // Ambil tanggal saja (Y-m-d) tanpa jam
        $tgl_harus_kembali = date('Y-m-d', strtotime($peminjaman['tgl_kembali']));
        $tgl_sekarang      = date('Y-m-d');

        $denda = 0;
        $status_denda = 'lunas';

        // Perbandingan: Jika hari ini melewati deadline
        if ($tgl_sekarang > $tgl_harus_kembali) {
            $awal  = new \DateTime($tgl_harus_kembali);
            $akhir = new \DateTime($tgl_sekarang);
            $diff  = $awal->diff($akhir);

            $selisih_hari = $diff->days;

            if ($selisih_hari > 0) {
                $denda = $selisih_hari * 5000; // Rp 5.000 per hari
                $status_denda = 'belum_bayar';
            }
        }

        // UPDATE DATABASE
        $this->peminjamanModel->update($id, [
            'status'               => 'selesai',
            'tanggal_dikembalikan' => date('Y-m-d H:i:s'),
            'denda'                => $denda,
            'status_denda'         => $status_denda
        ]);

        // Kembalikan Stok Alat
        $alat = $this->alatModel->find($peminjaman['id_alat']);
        $this->alatModel->update($peminjaman['id_alat'], ['stok' => $alat['stok'] + $peminjaman['jumlah']]);
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '43'
UPDATE `peminjaman` SET `status` = 'selesai', `tanggal_dikembalikan` = '2026-04-27 02:22:55', `denda` = 0, `status_denda` = 'lunas'
WHERE `peminjaman`.`id` IN ('43')
SELECT *
FROM `alat`
WHERE `alat`.`id` = '17'
UPDATE `alat` SET `stok` = 1
WHERE `alat`.`id` IN ('17')

    public function history()
    {
        $data = [
            'title'      => 'Riwayat Peminjaman',
            // UBAH: dari 'history' menjadi 'peminjaman' agar sesuai dengan View
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat, alat.kategori')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->where('peminjaman.status', 'selesai')
                ->orderBy('peminjaman.tanggal_dikembalikan', 'DESC') // Urutkan berdasarkan waktu kembali asli
                ->findAll()
---
SELECT `peminjaman`.*, `alat`.`nama_alat`, `alat`.`kategori`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'selesai'
ORDER BY `peminjaman`.`tanggal_dikembalikan` DESC