app/Controllers/Peminjaman.php

    public function konfirmasi_kembali($id)
    {
        $peminjaman = $this->peminjamanModel->find($id);
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '25'

    public function history()
    {
        $data = [
            'title'      => 'Riwayat Peminjaman',
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat, alat.kategori')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->where('peminjaman.status', 'selesai')
                ->orderBy('peminjaman.tanggal_dikembalikan', 'DESC')
                ->findAll()
        ];
---
SELECT `peminjaman`.*, `alat`.`nama_alat`, `alat`.`kategori`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'selesai'
ORDER BY `peminjaman`.`tanggal_dikembalikan` DESC