app/Views/layouts/menu.php

            <?php
            // Logika tambahan untuk menghitung yang telat (hanya untuk Admin/Petugas)
            $peminjamanModel = new \App\Models\PeminjamanModel();
            $jumlahTelat = $peminjamanModel->where('status', 'dipinjam')
                ->where('tgl_kembali <', date('Y-m-d'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
AND `tgl_kembali` < '2026-04-24'