app/Views/layouts/menu.php


        <?php
        $peminjamanModel = new \App\Models\PeminjamanModel();
        $jumlahTelat = $peminjamanModel->where('status', 'dipinjam')->where('tgl_kembali <', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
AND `tgl_kembali` < '2026-04-28'

        if ($namaUser) {
            $builder = $db->table('peminjaman');
            if ($role == 'admin') {
                $currentPinjam = $builder->whereIn('status', ['dipinjam', 'pending'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` IN ('dipinjam','pending')